Repository: foolery33/World-Cinema
Catalog: Mobile-Cinema-Lab1/Resources/Localization/Errors/*.lproj/Errors.strings
Languages: ru

# model_error
source: Internal application error. Please contact developer
ru: Внутренняя ошибка приложения. Пожалуйста, свяжитесь с разработчиком

# invalid_credentials
source: Either your email or password are incorrect. Please try again
ru: Либо ваш email, либо пароль неверны. Пожалуйста, попробуйте еще раз

# login_validation_error
source: Some validation error
ru: Ошибка валидации

# server_error
source: Some server error occured. Please try again later
ru: Произошла ошибка сервера. Пожалуйста, повторите попытку позже

# empty_field
source: Please make sure that you've provided all necessary data
ru: Пожалуйста, убедитесь, что вы указали все необходимые данные

# invalid_email
source: Your email does not conform to default email pattern
ru: Ваш E-mail не соответствует стандартному шаблону электронной почты

# different_passwords
source: You've provided different passwords. Make sure they are equal
ru: Вы указали разные пароли. Убедитесь, что они одинаковы

# wrong_endpoint
source: Endpoint provided in request is not valid. Please contact developer
ru: Ссылка, указанная в запросе, недействительна. Пожалуйста, свяжитесь с разработчиком

# no_query_parameter
source: No query parameter was provided. Please contact developer
ru: Был предоставлен неизвестный параметр запроса. Пожалуйста, свяжитесь с разработчиком

# unauthorized
source: Your authentication token is expired. Please login again
ru: Срок действия вашего авторизационного токена истек. Пожалуйста, войдите в систему снова

# unexpected_error
source: Some unexpected error occured. Please contact developer
ru: Возникла непредвиденная ошибка. Пожалуйста, свяжитесь с разработчиком

# no_cover
source: There're no cover in database
ru: В базе данных нет постера главного экрана

# something_went_wrong
source: Something went wrong. Please try again later
ru: Что-то пошло не по плану. Пожалуйста, повторите попытку позже

# wrong_collection_id
source: Provided collectionId is not valid. Please contact developer
ru: Предоставленный идентификатор коллекции недействителен. Пожалуйста, свяжитесь с разработчиком

# already_in_this_collection
source: This film is already in the collection
ru: Этот фильм уже есть в коллекции

# problem_with_save
source: Some problem with episode time saving occured
ru: Возникла проблема с сохранением времени эпизода
